'''
Назначение системы

Система будет находить наиболее актуальные навыки для какой либо вакансии (hh api)

Принцип работы системы

Система будет получать данные по вакансиям используя заданные параметры (например город, название вакансии, …). После того как получены описания всех вакансий по заданным параметрам, система будет проводит следующий анализ:

Сколько всего вакансий
Средняя заработная плата
Все требования к данному типу вакансий
В скольких вакансиях указано данное требование (сортируем по убыванию)

Пример работы
ищем вакансии со следующими параметрами python developer, регион москва

получаем 3 вакансии.
В 1-ой требования: python, django
во 2-ой python, django, flask,
в 3-ей python, sqlalchemy.

Таким образом 4-ый пункт будет выглядеть так:

python 3
django 2
flask 1
sqlalchemy 1

Также можно посчитать процент относительно всех требований

python 42.9 %
django 28.6 %
flask 14.3 %
sqlalchemy 14.3 %

Дополнительно можно добавить любую полезную аналитику, особенно актуально для студентов курсов искусственного интеллекта

Результат работы программы сохранить в файл в формате json (или в несколько файлов если удобно)



Пример итогового файла

[
   {'keywords': 'python developer',
    'count': '4',
    'requirements': [
        {
            'name': 'python',
            'count': 3,
            'persent': 42.9
        },
        {
            'name': 'django',
            'count': 2,
            'persent': 28.6
        },
        {
            'name': 'flask',
            'count': 1,
            'persent': 14.3
        },
        {
            'name': 'sqlalchemy',
            'count': 1,
            'persent': 14.3
        }
    ]
    },
   {'keywords': 'жестянщик',
    'count': '1',
    'requirements': [
        {
            'name': 'стрессоустойчивость',
            'count': 1,
            'persent': 100
        }
    ]
    }
]


'''